# Exercise 1

### Count the number of lines in Python for each file

In [1]:
import pandas as pd

In [2]:
pd.read_csv(r"C:\Users\paula\Desktop\Paula\Máster\9. Data Science challenge\challenge\bookings.csv.bz2")

ParserError: Error tokenizing data. C error: Expected 1 fields in line 5000009, saw 2

Tried to open it with pandas, but I got the above error

In [3]:
import bz2
import os

In [4]:
bookings = bz2.open(r"C:\Users\paula\Desktop\Paula\Máster\9. Data Science challenge\challenge\bookings.csv.bz2", "r")
count = 0

for line in bookings:

   count += 1

bookings.close()

count

10000011

In [5]:
searches = bz2.open(r"C:\Users\paula\Desktop\Paula\Máster\9. Data Science challenge\challenge\searches.csv.bz2", "r")

count = 0

for line in searches:

   count += 1

searches.close()

count

20390199

# Exercise 2
### Top 10 arrival airports in the world in 2013 (using the bookings file)
- Arrival airport is the column arr_port. It is the IATA code for the airport
-  To get the total number of passengers for an airport, you can sum the column pax, grouping by arr_port. Note that there is negative pax. That corresponds to cancelations. So to get the total number of passengers that have actually booked, you should sum including the negatives (that will remove the canceled bookings).
- Print the top 10 arrival airports in the standard output, including the number of passengers
- Bonus point: Get the name of the city or airport corresponding to that airport(programatically, we suggest to have a look at GeoBases in Github)
- Bonus point: Solve this problem using pandas (instead of any other approach)

Now trying to load the bookings file with Pandas again...

In [2]:
import pandas as pd
pd.read_csv(r"C:\Users\paula\Desktop\Paula\Máster\9. Data Science challenge\challenge\bookings.csv.bz2", compression= "bz2", nrows=1000, thousands= ",")

    act_date           ^source^pos_ctry^pos_iata^pos_oid  ^rloc          ^cre_date           ^duration^distance^dep_port^dep_city^dep_ctry^arr_port^arr_city^arr_ctry^lst_port^lst_city^lst_ctry^brd_port^brd_city^brd_ctry^off_port^off_city^off_ctry^mkt_port^mkt_city^mkt_ctry^intl^route          ^carrier^bkg_class^cab_class^brd_time           ^off_time           ^pax^year^month^oid
0    2013-03-05 00:00:00^1A    ^DE      ^a68dd7ae95...
1    2013-03-26 00:00:00^1A    ^US      ^e612b9eeee...
2    2013-03-26 00:00:00^1A    ^US      ^e612b9eeee...
3    2013-03-26 00:00:00^1A    ^AU      ^0f984b3bb6...
4    2013-03-26 00:00:00^1A    ^AU      ^0f984b3bb6...
..                                                 ...
995  2013-03-23 00:00:00^1P    ^US      ^bfafedb150...
996  2013-03-06 00:00:00^1P    ^US      ^83ccf07a55...
997  2013-03-06 00:00:00^1P    ^US      ^83ccf07a55...
998  2013-03-06 00:00:00^1P    ^US      ^0deb0937d0...
999  2013-03-07 00:00:00^1P    ^US      ^0deb0937d0...

[1000 rows x 1 columns]

I first checked what the separator was, then looking at the pandas documentation and the first error I got, I used the "error_bad_lines" = False parameter and "memory_map" = True to try and read the whole dataframe, but my Kernel keeps dying...

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html

bookings = pd.read_csv("/home/dsc/data/challenge/bookings.csv.bz2", compression= "bz2", sep = "^", error_bad_lines = False, memory_map = True)

In [3]:
bookings_n1000 = pd.read_csv(r"C:\Users\paula\Desktop\Paula\Máster\9. Data Science challenge\challenge\bookings.csv.bz2", compression= "bz2", sep = "^", error_bad_lines = False, memory_map = True, nrows=1000)

So I opened the first 1000 rows to see if I could at least do something with this

In [4]:
pd.options.display.max_columns = None
bookings_n1000

,act_date,source,pos_ctry,pos_iata,pos_oid,rloc,cre_date,duration,distance,dep_port,dep_city,dep_ctry,arr_port,arr_city,arr_ctry,lst_port,lst_city,lst_ctry,brd_port,brd_city,brd_ctry,off_port,off_city,off_ctry,mkt_port,mkt_city,mkt_ctry,intl,route,carrier,bkg_class,cab_class,brd_time,off_time,pax,year,month,oid
0,2013-03-05 00:00:00,1A,DE,a68dd7ae953c8acfb187a1af2dcbe123,1a11ae49fcbf545fd2afc1a24d88d2b7,ea65900e72d71f4626378e2ebd298267,2013-02-22 00:00:00,1708,0,ZRH,ZRH,CH,LHR,LON,GB,ZRH,ZRH,CH,LHR,LON,GB,ZRH,ZRH,CH,LHRZRH,LONZRH,CHGB,1,LHRZRH,VI,T,Y,2013-03-07 08:50:00,2013-03-07 11:33:37,-1,2013,3,NULL
1,2013-03-26 00:00:00,1A,US,e612b9eeeee6f17f42d9b0d3b79e75ca,7437560d8f276d6d05eeb806d9e7edee,737295a86982c941f1c2da9a46a14043,2013-03-26 00:00:00,135270,0,SAL,SAL,SV,CLT,CLT,US,SAL,SAL,SV,SAL,SAL,SV,CLT,CLT,US,CLTSAL,CLTSAL,SVUS,1,SALATLCLT,NV,L,Y,2013-04-12 13:04:00,2013-04-12 22:05:40,1,2013,3,NULL
2,2013-03-26 00:00:00,1A,US,e612b9eeeee6f17f42d9b0d3b79e75ca,7437560d8f276d6d05eeb806d9e7edee,737295a86982c941f1c2da9a46a14043,2013-03-26 00:00:00,135270,0,SAL,SAL,SV,CLT,CLT,US,SAL,SAL,SV,CLT,CLT,US,SAL,SAL,SV,CLTSAL,CLTSAL,SVUS,1,CLTATLSAL,NV,U,Y,2013-07-15 07:00:00,2013-07-15 11:34:51,1,2013,3,NULL
3,2013-03-26 00:00:00,1A,AU,0f984b3bb6bd06661c95529bbd6193bc,36472c6dbaf7afec9136ac40364e2794,5ecf00fdcbcec761c43dc7285253d0c1,2013-03-26 00:00:00,30885,0,AKL,AKL,NZ,SVO,MOW,RU,AKL,AKL,NZ,AKL,AKL,NZ,SVO,MOW,RU,AKLSVO,AKLMOW,NZRU,1,AKLHKGSVO,XK,G,Y,2013-04-24 23:59:00,2013-04-25 16:06:31,1,2013,3,SYDA82546
4,2013-03-26 00:00:00,1A,AU,0f984b3bb6bd06661c95529bbd6193bc,36472c6dbaf7afec9136ac40364e2794,5ecf00fdcbcec761c43dc7285253d0c1,2013-03-26 00:00:00,30885,0,AKL,AKL,NZ,SVO,MOW,RU,AKL,AKL,NZ,SVO,MOW,RU,AKL,AKL,NZ,AKLSVO,AKLMOW,NZRU,1,SVOHKGAKL,XK,G,Y,2013-05-14 20:15:00,2013-05-16 10:44:50,1,2013,3,SYDA82546
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,2013-03-23 00:00:00,1P,US,bfafedb1505531ad8e70e176941a7ad0,804deeaddf16e6a93d36e5d046040d60,be83fd657625d53f58c5d3070cdb41b8,2013-03-06 00:00:00,5570,0,SLC,SLC,US,MSN,MSN,US,SLC,SLC,US,SLC,SLC,US,MSN,MSN,US,MSNSLC,MSNSLC,USUS,0,SLCMSN,NV,K,Y,2013-05-20 14:00:00,2013-05-20 18:00:55,1,2013,3,NULL
996,2013-03-06 00:00:00,1P,US,83ccf07a55606976f78e63fcc805f58c,1490c3c5f95f04fa076fe15c775a80a9,691f15622668e671f51ba033ea904398,2013-03-06 00:00:00,4664,0,SNA,SNA,US,SFO,SFO,US,SNA,SNA,US,SNA,SNA,US,SFO,SFO,US,SFOSNA,SFOSNA,USUS,0,SNASFO,FK,V,Y,2013-03-17 13:31:00,2013-03-17 15:01:12,1,2013,3,NULL
997,2013-03-06 00:00:00,1P,US,83ccf07a55606976f78e63fcc805f58c,1490c3c5f95f04fa076fe15c775a80a9,691f15622668e671f51ba033ea904398,2013-03-06 00:00:00,4664,0,SNA,SNA,US,SFO,SFO,US,SNA,SNA,US,SFO,SFO,US,SNA,SNA,US,SFOSNA,SFOSNA,USUS,0,SFOSNA,FK,W,Y,2013-03-20 17:45:00,2013-03-20 19:15:12,1,2013,3,NULL
998,2013-03-06 00:00:00,1P,US,0deb0937d0f143f79505297b235eaeeb,f4ae494f0ebec1d84f6e01750d61747d,bed521f09feee94fcb87f705267b0327,2013-03-06 00:00:00,331,2598,LAX,LAX,US,MEM,MEM,US,MEM,MEM,US,LAX,LAX,US,MEM,MEM,US,LAXMEM,LAXMEM,USUS,0,LAXDFWMEM,KK,Y,Y,2013-03-09 07:30:00,2013-03-09 15:01:52,1,2013,3,NULL
999,2013-03-07 00:00:00,1P,US,0deb0937d0f143f79505297b235eaeeb,f4ae494f0ebec1d84f6e01750d61747d,bed521f09feee94fcb87f705267b0327,2013-03-06 00:00:00,331,2598,LAX,LAX,US,MEM,MEM,US,MEM,MEM,US,LAX,LAX,US,MEM,MEM,US,LAXMEM,LAXMEM,USUS,0,LAXDFWMEM,KK,Y,Y,2013-03-09 07:30:00,2013-03-09 15:01:52,-1,2013,3,NULL

In [5]:
type(bookings_n1000)

pandas.core.frame.DataFrame

Having a further look into the documentation, I'm going to try and use "usecols"

In [6]:
bookings = pd.read_csv(r"C:\Users\paula\Desktop\Paula\Máster\9. Data Science challenge\challenge\bookings.csv.bz2", compression= "bz2", sep = "^", error_bad_lines = False, memory_map = True, usecols = ["arr_port", "pax"], thousands=",")

In [7]:
bookings

          arr_port  pax
0         LHR      -1.0
1         CLT       1.0
2         CLT       1.0
3         SVO       1.0
4         SVO       1.0
...            ...  ...
10000005  MAA      -1.0
10000006  MAA       1.0
10000007  RDU       1.0
10000008  ORY       1.0
10000009  ORY       1.0

[10000010 rows x 2 columns]

Yessss! it worked!

In [8]:
passengers_by_airport = bookings.groupby("arr_port").sum()
passengers_by_airport

             pax
arr_port
AAB         30.0
AAE        810.0
AAL        810.0
AAN         20.0
AAQ       1650.0
...          ...
ZWE         30.0
ZWS        620.0
ZYL       1290.0
ZYN         20.0
ZYR       1020.0

[2275 rows x 1 columns]

In [9]:
passengers_by_airport.sort_values(by = "pax", ascending= False)

              pax
arr_port
LHR       88809.0
MCO       70930.0
LAX       70530.0
LAS       69630.0
JFK       66270.0
...           ...
MYJ         -80.0
UPG         -90.0
XWG         -90.0
MZV        -350.0
AYQ       -1270.0

[2275 rows x 1 columns]

When I thought we had it, in the next cell...

In [10]:
passengers_by_airport.sort_values(by = "pax", ascending= False)[0:10]

              pax
arr_port
LHR       88809.0
MCO       70930.0
LAX       70530.0
LAS       69630.0
JFK       66270.0
CDG       64490.0
BKK       59460.0
MIA       58150.0
SFO       58000.0
DXB       55590.0

Toni came and started talking about spaces, upper and lower case... so I have to normalise...

In [11]:
bookings["arr_port"].unique()

array(['LHR     ', 'CLT     ', 'SVO     ', ..., 'VEL     ', 'SLM     ',
       'SG      '], dtype=object)

I'm going to add another column in the dataframe (temporarily) that shows the lenght of the iata code for each row

In [12]:
bookings["iata_len"] = bookings["arr_port"].str.len()

In [13]:
bookings

          arr_port  pax  iata_len
0         LHR      -1.0         8
1         CLT       1.0         8
2         CLT       1.0         8
3         SVO       1.0         8
4         SVO       1.0         8
...            ...  ...       ...
10000005  MAA      -1.0         8
10000006  MAA       1.0         8
10000007  RDU       1.0         8
10000008  ORY       1.0         8
10000009  ORY       1.0         8

[10000010 rows x 3 columns]

Now, I'll try to replace empty spaces with nothing, so basically remove them

In [14]:
bookings["arr_port"].str.replace(" ","")

0           LHR
1           CLT
2           CLT
3           SVO
4           SVO
           ...
10000005    MAA
10000006    MAA
10000007    RDU
10000008    ORY
10000009    ORY
Name: arr_port, Length: 10000010, dtype: object

Why?? If I have removed all empty spaces why the lenght of the code is still not 3

In [15]:
bookings["iata_len"] = bookings["arr_port"].str.len()
bookings

          arr_port  pax  iata_len
0         LHR      -1.0         8
1         CLT       1.0         8
2         CLT       1.0         8
3         SVO       1.0         8
4         SVO       1.0         8
...            ...  ...       ...
10000005  MAA      -1.0         8
10000006  MAA       1.0         8
10000007  RDU       1.0         8
10000008  ORY       1.0         8
10000009  ORY       1.0         8

[10000010 rows x 3 columns]

In [16]:
bookings["iata_len"].sort_values

<bound method Series.sort_values of 0           8
1           8
2           8
3           8
4           8
           ..
10000005    8
10000006    8
10000007    8
10000008    8
10000009    8
Name: iata_len, Length: 10000010, dtype: int64>

So it seems all iata codes have lengh 8, so I need to find out a way to remove the spaces and then count the real lenght (as in how many letters are there)

In [17]:
bookings["arr_port"].str.len()

0           8
1           8
2           8
3           8
4           8
           ..
10000005    8
10000006    8
10000007    8
10000008    8
10000009    8
Name: arr_port, Length: 10000010, dtype: int64

In [18]:
bookings["arr_port"] = bookings["arr_port"].str.normalize(form = "NFC")

In [19]:
bookings["arr_port"] = bookings["arr_port"].str.strip(" ")

In [20]:
bookings["arr_port"].str.len()

0           3
1           3
2           3
3           3
4           3
           ..
10000005    3
10000006    3
10000007    3
10000008    3
10000009    3
Name: arr_port, Length: 10000010, dtype: int64

In [21]:
bookings["iata_len"] = bookings["arr_port"].str.len()
bookings

         arr_port  pax  iata_len
0             LHR -1.0         3
1             CLT  1.0         3
2             CLT  1.0         3
3             SVO  1.0         3
4             SVO  1.0         3
...           ...  ...       ...
10000005      MAA -1.0         3
10000006      MAA  1.0         3
10000007      RDU  1.0         3
10000008      ORY  1.0         3
10000009      ORY  1.0         3

[10000010 rows x 3 columns]

I'm going to remove the column I created for the lenght of the codes and I'll try to find out if actually all of them have lenght 3 (probably not)

In [22]:
bookings.drop("iata_len", axis = 1, inplace= True)

In [23]:
bookings

         arr_port  pax
0             LHR -1.0
1             CLT  1.0
2             CLT  1.0
3             SVO  1.0
4             SVO  1.0
...           ...  ...
10000005      MAA -1.0
10000006      MAA  1.0
10000007      RDU  1.0
10000008      ORY  1.0
10000009      ORY  1.0

[10000010 rows x 2 columns]

In [24]:
all_letters = bookings["arr_port"].str.isalpha()
all_letters

0           True
1           True
2           True
3           True
4           True
            ...
10000005    True
10000006    True
10000007    True
10000008    True
10000009    True
Name: arr_port, Length: 10000010, dtype: bool

In [25]:
import numpy as np

In [26]:
np.count_nonzero(all_letters)

10000010

What I have done above is making sure that all IATA codes are now just a combination of letters. Because all True elements are = 1, I have count all the elements in the Numpy matrix that are not 0, and it seems that all of them are true, which means that all the IATA codes are strings with only letters on them (so no more spaces or weird characters)

In [27]:
bookings["arr_port"].str.len().mean()

2.9999999000001

It seems that not all of them have exactly 3 letters, so let's try and only get those with 3 letters. Firstly, I am going to convert everything to upper case, just in case...

In [28]:
bookings["arr_port"].str.upper()

0           LHR
1           CLT
2           CLT
3           SVO
4           SVO
           ...
10000005    MAA
10000006    MAA
10000007    RDU
10000008    ORY
10000009    ORY
Name: arr_port, Length: 10000010, dtype: object

In [29]:
all_upper = bookings["arr_port"].str.isupper()

In [30]:
np.count_nonzero(all_upper)

10000010

In [31]:
wrong = bookings["arr_port"].str.len() < 3
wrong

0           False
1           False
2           False
3           False
4           False
            ...
10000005    False
10000006    False
10000007    False
10000008    False
10000009    False
Name: arr_port, Length: 10000010, dtype: bool

In [32]:
np.count_nonzero(wrong)

1

In [33]:
wrong = bookings["arr_port"].str.len() > 3
wrong

0           False
1           False
2           False
3           False
4           False
            ...
10000005    False
10000006    False
10000007    False
10000008    False
10000009    False
Name: arr_port, Length: 10000010, dtype: bool

In [34]:
np.count_nonzero(wrong)

0

So, it looks like there is only 1 row with a wrong IATA code (with just 2 letters), let's delete that row (firstly, I need to find which row it is)

In [35]:
wrong = bookings["arr_port"].str.len() < 3
wrong

0           False
1           False
2           False
3           False
4           False
            ...
10000005    False
10000006    False
10000007    False
10000008    False
10000009    False
Name: arr_port, Length: 10000010, dtype: bool

In [36]:
wrong.sort_values(ascending= False)

5000007      True
10000009    False
3333333     False
3333340     False
3333339     False
            ...
6666671     False
6666670     False
6666669     False
6666668     False
0           False
Name: arr_port, Length: 10000010, dtype: bool

Row 5.000.007 is the chosen one!

In [37]:
bookings = bookings.drop([5000007])

In [38]:
bookings["arr_port"].unique()

array(['LHR', 'CLT', 'SVO', ..., 'CNJ', 'VEL', 'SLM'], dtype=object)

In [39]:
count_of_airports = bookings["arr_port"].unique()
count_of_airports

array(['LHR', 'CLT', 'SVO', ..., 'CNJ', 'VEL', 'SLM'], dtype=object)

In [40]:
len(count_of_airports)

2274

There seems to be 2.274 different airports of arrival

In [41]:
bookings

         arr_port  pax
0             LHR -1.0
1             CLT  1.0
2             CLT  1.0
3             SVO  1.0
4             SVO  1.0
...           ...  ...
10000005      MAA -1.0
10000006      MAA  1.0
10000007      RDU  1.0
10000008      ORY  1.0
10000009      ORY  1.0

[10000009 rows x 2 columns]

I'm going to change the format of the passengers column now, as I don't want any decimals there (it's not possible to have 1.5 passengers, for example)

In [42]:
bookings["pax"] = bookings["pax"].astype(int)

bookings

         arr_port  pax
0             LHR   -1
1             CLT    1
2             CLT    1
3             SVO    1
4             SVO    1
...           ...  ...
10000005      MAA   -1
10000006      MAA    1
10000007      RDU    1
10000008      ORY    1
10000009      ORY    1

[10000009 rows x 2 columns]

In [43]:
passengers_by_airport = bookings.groupby("arr_port").sum()
passengers_by_airport

           pax
arr_port
AAB         30
AAE        810
AAL        810
AAN         20
AAQ       1650
...        ...
ZWE         30
ZWS        620
ZYL       1290
ZYN         20
ZYR       1020

[2274 rows x 1 columns]

In [44]:
passengers_by_airport.sort_values(by = "pax", ascending= False)

            pax
arr_port
LHR       88809
MCO       70930
LAX       70530
LAS       69630
JFK       66270
...         ...
MYJ         -80
UPG         -90
XWG         -90
MZV        -350
AYQ       -1270

[2274 rows x 1 columns]

It's very weird that some airports only have negative passengers. That would mean that they got more cancellations than actual arrivals. Let's have a look at AYQ, the one with the highest number of cancellations...

In [45]:
ayq = bookings[bookings.arr_port == "AYQ"]
ayq

        arr_port  pax
22548        AYQ  -29
22549        AYQ  -29
22550        AYQ  -29
22551        AYQ  -29
22552        AYQ  -29
...          ...  ...
9754363      AYQ   -1
9757785      AYQ    1
9757786      AYQ    1
9908476      AYQ   -2
9908477      AYQ    2

[780 rows x 2 columns]

According to Wikipedia: Ayers Rock Airport (also known as Connellan Airport) (IATA: AYQ, ICAO: YAYE) is situated near Yulara, around 463 km (288 mi) (5 hrs drive) away from Alice Springs, Northern Territory, and 20 minutes drive from Uluru (Ayers Rock) itself. An average of just under 300,000 passengers pass through this airport each year.

So, I would have expected it to have at least a few passengers...

Anyway, the top 10 arrival airports, including the number of passengers, are shown below:

In [46]:
top_ten_airports_arr = passengers_by_airport.sort_values(by = "pax", ascending= False)[0:10]
top_ten_airports_arr

            pax
arr_port
LHR       88809
MCO       70930
LAX       70530
LAS       69630
JFK       66270
CDG       64490
BKK       59460
MIA       58150
SFO       58000
DXB       55590

### Bonus point: Get the name of the city or airport corresponding to that airport (programatically, we suggest to have a look at GeoBases in Github)

So I have checked GitHub and downloaded as a csv:

https://github.com/opentraveldata/geobases/tree/public/GeoBases/DataSources/Airports/GeoNames

GeoBases/DataSources/Airports/GeoNames/airports_geonames_only_clean.csv

In [47]:
airport_names = pd.read_csv("C:/Users/paula/Desktop/Paula/Máster/9. Data Science challenge/airports_geonames_only_clean.csv", sep = "^", error_bad_lines = False, memory_map = True)
airport_names

,AUH,Abu Dhabi International Airport,AUH.1,AE,United Arab Emirates,24.4329720,54.6511380
0,AZI,Abu Dhabi Bateen Airport,AUH,AE,United Arab Emirates,24.428333,54.458084
1,AAN,Al Ain International Airport,AAN,AE,United Arab Emirates,24.261667,55.609167
2,DXB,Dubai International Airport,DXB,AE,United Arab Emirates,25.252778,55.364444
3,FJR,Fujairah,FJR,AE,United Arab Emirates,25.112225,56.323964
4,RKT,Ras Al Khaimah International Airport,RKT,AE,United Arab Emirates,25.613483,55.938817
...,...,...,...,...,...,...,...
3553,OHD,Ohrid,OHD,NaN,NaN,41.179956,20.742325
3554,SKP,Skopje-Petrovec,SKP,NaN,NaN,41.961622,21.621381
3555,PSY,Stanley Airport,PSY,NaN,NaN,-51.685672,-57.777644
3556,TIH,Tikehau Atoll,TIH,NaN,NaN,-15.119442,-148.230457
3557,MOZ,Temae,MOZ,NaN,NaN,-17.488794,-149.762020

The csv I dowloaded with the IATA codes + Airport name do not have a header, but I only need the first 2 columns, so I'm going to get rid of the other columns and add a header to those 2

In [48]:
airport_names = pd.read_csv("C:/Users/paula/Desktop/Paula/Máster/9. Data Science challenge/airports_geonames_only_clean.csv", sep = "^", error_bad_lines = False, memory_map = True, names = ["IATA_code", "Airport","1","2","3","4","5"], usecols= ["IATA_code", "Airport"])
airport_names

     IATA_code                          Airport
0          AUH  Abu Dhabi International Airport
1          AZI         Abu Dhabi Bateen Airport
2          AAN     Al Ain International Airport
3          DXB      Dubai International Airport
4          FJR                         Fujairah
...        ...                              ...
3554       OHD                            Ohrid
3555       SKP                  Skopje-Petrovec
3556       PSY                  Stanley Airport
3557       TIH                    Tikehau Atoll
3558       MOZ                            Temae

[3559 rows x 2 columns]

In [49]:
airport_names.dtypes

IATA_code    object
Airport      object
dtype: object

Let's now investigate a bit if the data is in the way I want it, same as I have done before with the bookings file

In [50]:
airport_names["IATA_code"].str.len()

0       3
1       3
2       3
3       3
4       3
       ..
3554    3
3555    3
3556    3
3557    3
3558    3
Name: IATA_code, Length: 3559, dtype: int64

In [51]:
airport_names["IATA_code"] = airport_names["IATA_code"].str.strip(" ")

In [52]:
airport_names["IATA_code"].str.len().mean()

3.011239112110143

In [53]:
wrong_length = airport_names["IATA_code"].str.len() < 3
wrong_length
np.count_nonzero(wrong_length)

0

In [54]:
wrong_length = airport_names["IATA_code"].str.len() > 3
wrong_length
np.count_nonzero(wrong_length)

40

Before, I only had to drop 1 line, so it was easy to find the index and then use drop using the index name. However, now I have 40 rows I want to delete, so let's find a way to do this...

In [55]:
wrong_length.sort_values(ascending=False)

2315     True
2699     True
2677     True
2860     True
2754     True
        ...
2346    False
2345    False
2344    False
2343    False
0       False
Name: IATA_code, Length: 3559, dtype: bool

In [56]:
indexWrongLength = airport_names[wrong_length == 1].index
indexWrongLength

Int64Index([1043, 2250, 2315, 2337, 2364, 2403, 2500, 2514, 2519, 2534, 2537,
            2598, 2602, 2634, 2643, 2667, 2674, 2677, 2685, 2691, 2692, 2699,
            2700, 2714, 2734, 2751, 2754, 2832, 2855, 2860, 2884, 2885, 2937,
            2938, 2975, 2981, 3045, 3052, 3094, 3107],
           dtype='int64')

In [57]:
airport_names.drop(indexWrongLength, inplace = True)

In [58]:
airport_names["IATA_code"].str.len().mean()

3.0

In [59]:
all_letters = airport_names["IATA_code"].str.isalpha()
all_letters
np.count_nonzero(all_letters)

3517

In [60]:
len(airport_names)

3519

There are 2 IATA codes that are not just letters, let's delete those too

In [61]:
indexWrongType = airport_names[all_letters == 0].index
indexWrongType

Int64Index([2253, 3407], dtype='int64')

In [62]:
airport_names[2251:2252]

     IATA_code           Airport
2253       3M5  Moontown Airport

In [63]:
airport_names.drop(indexWrongType, inplace = True)

In [64]:
airport_names

     IATA_code                          Airport
0          AUH  Abu Dhabi International Airport
1          AZI         Abu Dhabi Bateen Airport
2          AAN     Al Ain International Airport
3          DXB      Dubai International Airport
4          FJR                         Fujairah
...        ...                              ...
3554       OHD                            Ohrid
3555       SKP                  Skopje-Petrovec
3556       PSY                  Stanley Airport
3557       TIH                    Tikehau Atoll
3558       MOZ                            Temae

[3517 rows x 2 columns]

In [65]:
airport_names["IATA_code"].str.upper()

0       AUH
1       AZI
2       AAN
3       DXB
4       FJR
       ...
3554    OHD
3555    SKP
3556    PSY
3557    TIH
3558    MOZ
Name: IATA_code, Length: 3517, dtype: object

In [66]:
top_ten_airports_arr

            pax
arr_port
LHR       88809
MCO       70930
LAX       70530
LAS       69630
JFK       66270
CDG       64490
BKK       59460
MIA       58150
SFO       58000
DXB       55590

To be able to do a merge, let's change the column name from "arr_port" to "IATA_code"

In [67]:
top_ten_airports_arr.rename(columns = {"arr_port": "IATA_code"}, inplace = True)

In [68]:
top_ten_airports_arr

            pax
arr_port
LHR       88809
MCO       70930
LAX       70530
LAS       69630
JFK       66270
CDG       64490
BKK       59460
MIA       58150
SFO       58000
DXB       55590

Why doesn't it work???

In [69]:
top_ten_airports_arr.columns.values

array(['pax'], dtype=object)

It looks like "arr_port" is not a column name, because it is the index, so let's change this

In [70]:
top_ten_airports_arr["arr_port"] = top_ten_airports_arr.index
top_ten_airports_arr

            pax arr_port
arr_port
LHR       88809      LHR
MCO       70930      MCO
LAX       70530      LAX
LAS       69630      LAS
JFK       66270      JFK
CDG       64490      CDG
BKK       59460      BKK
MIA       58150      MIA
SFO       58000      SFO
DXB       55590      DXB

In [71]:
top_ten_airports_arr.rename(columns = {"arr_port": "IATA_code"}, inplace = True)
top_ten_airports_arr

            pax IATA_code
arr_port
LHR       88809       LHR
MCO       70930       MCO
LAX       70530       LAX
LAS       69630       LAS
JFK       66270       JFK
CDG       64490       CDG
BKK       59460       BKK
MIA       58150       MIA
SFO       58000       SFO
DXB       55590       DXB

In [72]:
top_ten_airports_passengers = pd.merge(top_ten_airports_arr, airport_names, on = "IATA_code", how ="left")
top_ten_airports_passengers

     pax IATA_code                               Airport
0  88809       LHR               London Heathrow Airport
1  70930       MCO         Orlando International Airport
2  70530       LAX     Los Angeles International Airport
3  69630       LAS        McCarran International Airport
4  66270       JFK  John F Kennedy International Airport
5  64490       CDG             Paris - Charles-de-Gaulle
6  59460       BKK                          Suvarnabhumi
7  58150       MIA           Miami International Airport
8  58000       SFO   San Francisco International Airport
9  55590       DXB           Dubai International Airport

Finally, you can see above the passengers, IATA code and Airport of the top ten arrival airports

# Exercise 3
## Plot the monthly number of searches for flights arriving at Málaga, Madrid or Barcelona
- For the arriving airport, you can use the Destination column in the searches file.
- Plot a curve for Málaga, another one for Madrid, and another one for Barcelona, in the same figure.